In [2216]:
import pandas as pd

# Population (race, sex, age)

## 1980

### data wrangling

In [2217]:
pop = pd.read_csv(
    "../../data/pop_1980.csv", skiprows=5, header=0
)  # first couple rows are informational text about csv
pop = pop.drop(0)  # first row empty
pop

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,40 to 44 years,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over
1,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,854.0,828.0,631.0,524.0,428.0,358.0,242.0,123.0,52.0,39.0
2,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,882.0,739.0,602.0,532.0,451.0,417.0,332.0,237.0,137.0,86.0
3,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,133.0,107.0,113.0,113.0,126.0,128.0,87.0,70.0,31.0,13.0
4,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,147.0,154.0,165.0,150.0,166.0,160.0,119.0,94.0,57.0,44.0
5,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,2.0,4.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
188456,1989.0,56045.0,White female,227.0,308.0,268.0,226.0,140.0,205.0,289.0,...,209.0,187.0,165.0,162.0,153.0,148.0,120.0,86.0,63.0,52.0
188457,1989.0,56045.0,Black male,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
188458,1989.0,56045.0,Black female,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
188459,1989.0,56045.0,Other races male,4.0,1.0,2.0,4.0,9.0,4.0,2.0,...,0.0,2.0,3.0,1.0,1.0,1.0,1.0,0.0,0.0,0.0
188460,1989.0,56045.0,Other races female,3.0,5.0,4.0,4.0,4.0,5.0,6.0,...,2.0,7.0,6.0,3.0,1.0,0.0,0.0,1.0,0.0,0.0

In [2218]:
pop_1980 = pop.query("`Year of Estimate` == 1980")
pop_1980

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,40 to 44 years,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over
1,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,854.0,828.0,631.0,524.0,428.0,358.0,242.0,123.0,52.0,39.0
2,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,882.0,739.0,602.0,532.0,451.0,417.0,332.0,237.0,137.0,86.0
3,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,133.0,107.0,113.0,113.0,126.0,128.0,87.0,70.0,31.0,13.0
4,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,147.0,154.0,165.0,150.0,166.0,160.0,119.0,94.0,57.0,44.0
5,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,2.0,4.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18842,1980.0,56045.0,White female,337.0,291.0,284.0,286.0,316.0,318.0,239.0,...,198.0,164.0,166.0,176.0,137.0,126.0,90.0,70.0,41.0,48.0
18843,1980.0,56045.0,Black male,0.0,0.0,0.0,1.0,2.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
18844,1980.0,56045.0,Black female,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
18845,1980.0,56045.0,Other races male,4.0,6.0,8.0,5.0,8.0,4.0,3.0,...,2.0,2.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
18846,1980.0,56045.0,Other races female,8.0,8.0,7.0,4.0,6.0,6.0,3.0,...,3.0,5.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [2219]:
# add total population column
cols_to_sum = list(pop_1980.columns)[3:]
pop_1980["Total Population"] = pop_1980[cols_to_sum].sum(axis=1)
pop_1980.head()

/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_29781/3767407256.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pop_1980["Total Population"] = pop_1980[cols_to_sum].sum(axis=1)

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,45 to 49 years,50 to 54 years,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population
1,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,828.0,631.0,524.0,428.0,358.0,242.0,123.0,52.0,39.0,12394.0
2,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,739.0,602.0,532.0,451.0,417.0,332.0,237.0,137.0,86.0,12482.0
3,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,107.0,113.0,113.0,126.0,128.0,87.0,70.0,31.0,13.0,3383.0
4,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,154.0,165.0,150.0,166.0,160.0,119.0,94.0,57.0,44.0,3810.0
5,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,4.0,1.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,48.0

In [2220]:
# only include msas in BFI dataset
bfi_df = pd.read_csv("../../data/the_rise_of_healthcare_jobs_disclosed_data_by_msa.csv")
bfi_df.head()

,metro13,metro_title,change_ln_population,not_lbfr_share_prime_change,unemployed_share_prime_change,non_hc_share_prime_change,hc_emp_share_prime_change,manu_share_prime_change,non_manu_share_prime_change,manufacturing_share_prime1980,...,ln_aearn2022,change_earnings,college1980,college2022,change_college,healthcare_share_prime2022,healthcare_share_prime1980,change_non_hc_share_lbfr,change_ln_non_hc,non_hc_manu_share_prime_change
0,1,AL,0.006923,-0.01089,-0.01635,-0.020300,0.04754,-0.109100,0.13640,0.24990,...,10.61,0.4585,0.07756,0.1600,0.08243,0.08564,0.03810,-0.05360,0.01936,0.088800
1,5,AR,-0.027700,-0.02280,-0.01652,-0.009817,0.04915,-0.034590,0.07392,0.18920,...,10.61,0.4778,0.07879,0.1613,0.08254,0.08988,0.04074,-0.05038,0.02297,0.024760
2,6,CA,0.360200,-0.07647,-0.02523,0.080720,0.02098,-0.026890,0.12860,0.07481,...,10.89,0.5453,0.13910,0.2361,0.09704,0.06424,0.04326,-0.02911,0.38450,0.107610
3,8,CO,0.419600,-0.09702,-0.01325,0.087190,0.02308,0.008112,0.10220,0.03467,...,10.84,0.5516,0.15570,0.3569,0.20120,0.06779,0.04471,-0.02375,0.52890,0.079078
4,12,FL,0.463400,-0.05614,-0.00591,0.031780,0.03028,-0.065120,0.12720,0.09937,...,10.73,0.3837,0.14390,0.2902,0.14630,0.09054,0.06027,-0.03358,0.52410,0.096890

In [2221]:
# map county to msa
msa_county = pd.read_csv("../../data/cbsatocountycrosswalk.csv", encoding="latin1")
msa_county

,countyname,state,ssacounty,fipscounty,cbsa,cbsaname,ssast,fipst
0,AUTAUGA,AL,1000,1001,33860.0,"Montgomery, AL",1,1
1,BALDWIN,AL,1010,1003,NaN,NaN,1,1
2,BARBOUR,AL,1020,1005,NaN,NaN,1,1
3,BIBB,AL,1030,1007,13820.0,"Birmingham-Hoover, AL",1,1
4,BLOUNT,AL,1040,1009,13820.0,"Birmingham-Hoover, AL",1,1
...,...,...,...,...,...,...,...,...
3268,VIEQUES,PR,40740,72147,NaN,NaN,40,72
3269,VILLALBA,PR,40750,72149,38660.0,"Ponce, PR",40,72
3270,YABUCOA,PR,40760,72151,41980.0,"San Juan-Caguas-Guaynabo, PR",40,72
3271,YAUCO,PR,40770,72153,49500.0,"Yauco, PR",40,72
3272,"PUERTO RICO, NFD",PR,40999,72990,NaN,NaN,40,72

In [2222]:
# add msa codes to each county
msa_pop_1980 = pop_1980.merge(
    msa_county[["ssacounty", "fipscounty", "cbsaname"]],
    left_on="FIPS State and County Codes",
    right_on="fipscounty",
    how="inner",
).drop(columns=["fipscounty"])
msa_pop_1980

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population,ssacounty,cbsaname
0,1980.0,1001.0,White male,985.0,1096.0,1271.0,1308.0,972.0,850.0,891.0,...,524.0,428.0,358.0,242.0,123.0,52.0,39.0,12394.0,1000,"Montgomery, AL"
1,1980.0,1001.0,White female,831.0,987.0,1074.0,1259.0,1006.0,912.0,983.0,...,532.0,451.0,417.0,332.0,237.0,137.0,86.0,12482.0,1000,"Montgomery, AL"
2,1980.0,1001.0,Black male,357.0,427.0,395.0,460.0,300.0,240.0,163.0,...,113.0,126.0,128.0,87.0,70.0,31.0,13.0,3383.0,1000,"Montgomery, AL"
3,1980.0,1001.0,Black female,346.0,395.0,415.0,429.0,380.0,235.0,196.0,...,150.0,166.0,160.0,119.0,94.0,57.0,44.0,3810.0,1000,"Montgomery, AL"
4,1980.0,1001.0,Other races male,4.0,9.0,4.0,10.0,3.0,2.0,4.0,...,1.0,0.0,1.0,0.0,0.0,0.0,0.0,48.0,1000,"Montgomery, AL"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18805,1980.0,56045.0,White female,337.0,291.0,284.0,286.0,316.0,318.0,239.0,...,176.0,137.0,126.0,90.0,70.0,41.0,48.0,3499.0,53220,NaN
18806,1980.0,56045.0,Black male,0.0,0.0,0.0,1.0,2.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,5.0,53220,NaN
18807,1980.0,56045.0,Black female,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,53220,NaN
18808,1980.0,56045.0,Other races male,4.0,6.0,8.0,5.0,8.0,4.0,3.0,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,44.0,53220,NaN
18809,1980.0,56045.0,Other races female,8.0,8.0,7.0,4.0,6.0,6.0,3.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,55.0,53220,NaN

In [2223]:
# keep only rows relevant to bfi dataset
merged_pop_1980 = msa_pop_1980.merge(
    bfi_df[["metro13", "metro_title"]],
    left_on="ssacounty",
    right_on="metro13",
    how="inner",
).drop(columns=["ssacounty", "cbsaname"])
merged_pop_1980

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,55 to 59 years,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population,metro13,metro_title
0,1980.0,12085.0,White male,1336.0,1540.0,1761.0,2160.0,2095.0,1865.0,1799.0,...,1681.0,2225.0,2546.0,2243.0,1472.0,683.0,316.0,29192.0,10420,"Akron, OH"
1,1980.0,12085.0,White female,1291.0,1447.0,1652.0,1912.0,1816.0,1743.0,1735.0,...,2275.0,2786.0,2935.0,2472.0,1548.0,791.0,483.0,30568.0,10420,"Akron, OH"
2,1980.0,12085.0,Black male,244.0,259.0,277.0,270.0,234.0,175.0,155.0,...,87.0,88.0,71.0,47.0,43.0,16.0,8.0,2414.0,10420,"Akron, OH"
3,1980.0,12085.0,Black female,256.0,239.0,245.0,292.0,257.0,159.0,181.0,...,96.0,92.0,80.0,65.0,46.0,24.0,13.0,2496.0,10420,"Akron, OH"
4,1980.0,12085.0,Other races male,9.0,6.0,7.0,22.0,17.0,14.0,13.0,...,4.0,6.0,4.0,2.0,2.0,0.0,2.0,142.0,10420,"Akron, OH"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
277,1980.0,51069.0,White female,1181.0,1313.0,1508.0,1530.0,1333.0,1423.0,1508.0,...,820.0,642.0,517.0,398.0,266.0,154.0,150.0,16878.0,49340,"Worcester, MA-CT"
278,1980.0,51069.0,Black male,12.0,22.0,27.0,47.0,23.0,13.0,31.0,...,7.0,7.0,10.0,2.0,7.0,4.0,0.0,262.0,49340,"Worcester, MA-CT"
279,1980.0,51069.0,Black female,17.0,23.0,27.0,20.0,9.0,32.0,17.0,...,9.0,8.0,6.0,5.0,4.0,4.0,3.0,230.0,49340,"Worcester, MA-CT"
280,1980.0,51069.0,Other races male,4.0,1.0,4.0,3.0,3.0,1.0,4.0,...,0.0,0.0,1.0,1.0,0.0,0.0,0.0,32.0,49340,"Worcester, MA-CT"
281,1980.0,51069.0,Other races female,9.0,7.0,1.0,2.0,9.0,4.0,9.0,...,3.0,0.0,1.0,0.0,0.0,1.0,0.0,59.0,49340,"Worcester, MA-CT"

In [2224]:
# table of total populations per msa
total_pop = merged_pop_1980.groupby(["metro13", "metro_title"], as_index=False)[
    "Total Population"
].sum()
total_pop = total_pop.rename(columns={"Total Population": "MSA Population"})
total_pop.head()

   metro13                            metro_title  MSA Population
0    10420                              Akron, OH         64964.0
1    10580            Albany-Schenectady-Troy, NY        182019.0
2    14460         Boston-Cambridge-Newton, MA-NH         33114.0
3    14860        Bridgeport-Stamford-Norwalk, CT          6117.0
4    15380  Buffalo-Cheektowaga-Niagara Falls, NY         30439.0

In [2225]:
msa_tables_1980 = {}

cats = [
    "White male",
    "Black male",
    "Other races male",
    "White female",
    "Black female",
    "Other races female",
]

agg = merged_pop_1980.groupby(["metro_title", "Race/Sex Indicator"], as_index=False)[
    "Total Population"
].sum()

for msa, g in agg.groupby("metro_title", sort=True):
    p = g.pivot_table(
        index="Race/Sex Indicator",
        values="Total Population",
        aggfunc="sum",
        fill_value=0,
    ).reindex(cats)

    # male totals & shares
    male_total = p.loc[["White male", "Black male", "Other races male"]].sum().item()
    male_white = 0 if male_total == 0 else p.loc["White male"].item() / male_total * 100
    male_black = 0 if male_total == 0 else p.loc["Black male"].item() / male_total * 100
    male_other = (
        0 if male_total == 0 else p.loc["Other races male"].item() / male_total * 100
    )

    # female totals & shares
    female_total = (
        p.loc[["White female", "Black female", "Other races female"]].sum().item()
    )
    female_white = (
        0 if female_total == 0 else p.loc["White female"].item() / female_total * 100
    )
    female_black = (
        0 if female_total == 0 else p.loc["Black female"].item() / female_total * 100
    )
    female_other = (
        0
        if female_total == 0
        else p.loc["Other races female"].item() / female_total * 100
    )

    proportions = pd.DataFrame(
        {
            "White": [male_white, female_white],
            "Black": [male_black, female_black],
            "Other": [male_other, female_other],
        },
        index=["Male", "Female"],
    ).round(2)

    msa_tables_1980[msa] = proportions

    print(f"\n=== {msa} ===")
    print(proportions)

=== Akron, OH ===
        White  Black  Other
Male    91.95   7.60   0.45
Female  92.03   7.51   0.46

=== Albany-Schenectady-Troy, NY ===
        White  Black  Other
Male    89.65   9.44   0.91
Female  88.56  10.44   1.00

=== Boston-Cambridge-Newton, MA-NH ===
        White  Black  Other
Male    99.17   0.58   0.25
Female  99.11   0.63   0.26

=== Bridgeport-Stamford-Norwalk, CT ===
        White  Black  Other
Male    99.74   0.13   0.13
Female  99.84   0.07   0.10

=== Buffalo-Cheektowaga-Niagara Falls, NY ===
        White  Black  Other
Male    98.17   1.42   0.41
Female  98.32   1.20   0.49

=== Charleston-North Charleston, SC ===
        White  Black  Other
Male    99.88   0.02    0.1
Female  99.89   0.01    0.1

=== Charlotte-Concord-Gastonia, NC-SC ===
        White  Black  Other
Male    99.45   0.29   0.25
Female  99.56   0.08   0.36

=== Chicago-Naperville-Elgin, IL-IN-WI ===
        White  Black  Other
Male    99.52    0.0   0.48
Female  99.23    0.0   0.77

=== Cincinnati, OH-KY-IN ===
        White  Black  Other
Male    99.54   0.24   0.22
Female  99.79   0.06   0.15

=== Colorado Springs, CO ===
        White  Black  Other
Male    99.82   0.00   0.18
Female  99.65   0.09   0.26

=== Columbia, SC ===
        White  Black  Other
Male    99.22   0.29   0.50
Female  99.05   0.33   0.62

=== Columbus, OH ===
        White  Black  Other
Male    99.36   0.49   0.15
Female  99.16   0.55   0.28

=== Dallas-Fort Worth-Arlington, TX ===
        White  Black  Other
Male    82.57  17.30   0.13
Female  80.62  19.26   0.13

=== Dayton, OH ===
        White  Black  Other
Male    60.11  39.76   0.14
Female  56.67  43.17   0.15

=== Fresno, CA ===
        White  Black  Other
Male    84.21  15.24   0.55
Female  81.08  17.86   1.06

=== Grand Rapids-Wyoming, MI ===
        White  Black  Other
Male    99.88    0.0   0.12
Female  99.73    0.0   0.27

=== Greensboro-High Point, NC ===
        White  Black  Other
Male    99.66   0.04   0.31
Female  99.51   0.07   0.42

=== Greenville-Anderson-Mauldin, SC ===
        White  Black  Other
Male    99.21    0.0   0.79
Female  98.86    0.0   1.14

=== Harrisburg-Carlisle, PA ===
        White  Black  Other
Male    70.64  29.25   0.11
Female  69.35  30.50   0.15

=== Hartford-West Hartford-East Hartford, CT ===
        White  Black  Other
Male    85.58  14.10   0.32
Female  84.19  15.55   0.26

=== Indianapolis-Carmel-Anderson, IN ===
        White  Black  Other
Male    99.44   0.11   0.44
Female  99.55   0.05   0.41

=== Jacksonville, FL ===
        White  Black  Other
Male    98.38   0.04   1.58
Female  98.20   0.03   1.76

=== Kansas City, MO-KS ===
        White  Black  Other
Male    99.40   0.04   0.56
Female  99.42   0.08   0.49

=== Milwaukee-Waukesha-West Allis, WI ===
        White  Black  Other
Male    99.65   0.09   0.26
Female  99.64   0.03   0.33

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===
        White  Black  Other
Male    94.98   4.90   0.12
Female  95.26   4.63   0.12

=== New Haven-Milford, CT ===
        White  Black  Other
Male    88.23   0.00  11.77
Female  87.37   0.03  12.60

=== New Orleans-Metairie, LA ===
        White  Black  Other
Male    98.46   0.05   1.49
Female  98.53   0.04   1.42

=== Ogden-Clearfield, UT ===
        White  Black  Other
Male    99.54   0.15   0.31
Female  99.62   0.07   0.31

=== Oklahoma City, OK ===
        White  Black  Other
Male    94.08   5.52   0.40
Female  94.08   5.48   0.45

=== Omaha-Council Bluffs, NE-IA ===
        White  Black  Other
Male    98.87   0.86   0.27
Female  98.87   0.88   0.24

=== Orlando-Kissimmee-Sanford, FL ===
        White  Black  Other
Male    95.66   4.02   0.32
Female  97.97   1.69   0.34

=== Oxnard-Thousand Oaks-Ventura, CA ===
        White  Black  Other
Male    72.61   1.28  26.11
Female  72.42   1.21  26.37

=== Palm Bay-Melbourne-Titusville, FL ===
        White  Black  Other
Male    85.97   2.41  11.62
Female  85.45   2.95  11.60

=== Phoenix-Mesa-Scottsdale, AZ ===
        White  Black  Other
Male    98.87   0.05   1.08
Female  98.52   0.03   1.45

=== Pittsburgh, PA ===
        White  Black  Other
Male    98.08   0.59   1.33
Female  98.36   0.27   1.37

=== Provo-Orem, UT ===
        White  Black  Other
Male    99.29   0.31   0.39
Female  99.37   0.20   0.43

=== Raleigh, NC ===
        White  Black  Other
Male    99.23   0.18   0.59
Female  99.28   0.09   0.63

=== Spokane-Spokane Valley, WA ===
        White  Black  Other
Male    99.33   0.46   0.21
Female  99.22   0.51   0.27

=== Springfield, MA ===
        White  Black  Other
Male    97.65   2.20   0.15
Female  97.40   2.42   0.18

=== Stockton-Lodi, CA ===
        White  Black  Other
Male    97.63   1.63   0.74
Female  97.72   1.65   0.63

=== Syracuse, NY ===
        White  Black  Other
Male    99.03   0.52   0.45
Female  99.07   0.48   0.45

=== Tampa-St. Petersburg-Clearwater, FL ===
        White  Black  Other
Male    98.77   0.13   1.10
Female  98.75   0.12   1.13

=== Toledo, OH ===
        White  Black  Other
Male    84.05  15.40   0.54
Female  82.85  16.54   0.61

=== Tucson, AZ ===
        White  Black  Other
Male    97.31   0.03   2.66
Female  97.19   0.00   2.81

=== Tulsa, OK ===
        White  Black  Other
Male    99.19    0.0   0.81
Female  98.85    0.0   1.15

=== Winston-Salem, NC ===
        White  Black  Other
Male    22.82  68.91   8.28
Female  19.65  72.00   8.35

=== Worcester, MA-CT ===
        White  Black  Other
Male    98.29   1.52   0.19
Female  98.32   1.34   0.34

In [2226]:
merged_pop_1980 = merged_pop_1980.merge(
    total_pop[["metro13", "MSA Population"]],
    on="metro13",
    how="left",  # left join keeps all df_main rows
)
merged_pop_1980.head()

,Year of Estimate,FIPS State and County Codes,Race/Sex Indicator,Under 5 years,5 to 9 years,10 to 14 years,15 to 19 years,20 to 24 years,25 to 29 years,30 to 34 years,...,60 to 64 years,65 to 69 years,70 to 74 years,75 to 79 years,80 to 84 years,85 years and over,Total Population,metro13,metro_title,MSA Population
0,1980.0,12085.0,White male,1336.0,1540.0,1761.0,2160.0,2095.0,1865.0,1799.0,...,2225.0,2546.0,2243.0,1472.0,683.0,316.0,29192.0,10420,"Akron, OH",64964.0
1,1980.0,12085.0,White female,1291.0,1447.0,1652.0,1912.0,1816.0,1743.0,1735.0,...,2786.0,2935.0,2472.0,1548.0,791.0,483.0,30568.0,10420,"Akron, OH",64964.0
2,1980.0,12085.0,Black male,244.0,259.0,277.0,270.0,234.0,175.0,155.0,...,88.0,71.0,47.0,43.0,16.0,8.0,2414.0,10420,"Akron, OH",64964.0
3,1980.0,12085.0,Black female,256.0,239.0,245.0,292.0,257.0,159.0,181.0,...,92.0,80.0,65.0,46.0,24.0,13.0,2496.0,10420,"Akron, OH",64964.0
4,1980.0,12085.0,Other races male,9.0,6.0,7.0,22.0,17.0,14.0,13.0,...,6.0,4.0,2.0,2.0,0.0,2.0,142.0,10420,"Akron, OH",64964.0

In [2227]:
merged_pop_1980.columns

Index(['Year of Estimate', 'FIPS State and County Codes', 'Race/Sex Indicator',
       'Under 5 years', '5 to 9 years', '10 to 14 years', '15 to 19 years',
       '20 to 24 years', '25 to 29 years', '30 to 34 years', '35 to 39 years',
       '40 to 44 years', '45 to 49 years', '50 to 54 years', '55 to 59 years',
       '60 to 64 years', '65 to 69 years', '70 to 74 years', '75 to 79 years',
       '80 to 84 years', '85 years and over', 'Total Population', 'metro13',
       'metro_title', 'MSA Population'],
      dtype='object')

### make 1980 look like 2022 data structure

In [2228]:
age_groups_with_total = ["Total Population"] + merged_pop_1980.columns[3:-4].to_list()

id_vars = [
    "Year of Estimate",
    "FIPS State and County Codes",
    "metro13",
    "metro_title",
]

# stack the age groups (+ Total Population) into a single column
long_df = merged_pop_1980.melt(
    id_vars=id_vars + ["Race/Sex Indicator"],
    value_vars=age_groups_with_total,
    var_name="AGEGRP",
    value_name="Population",
)

# normalize the race/sex label for gender detection
rsi_norm = long_df["Race/Sex Indicator"].astype(str).str.strip().str.lower()

# add an MSA Pop per age group as a new "race/sex" category
msa_totals = long_df.groupby(id_vars + ["AGEGRP"], as_index=False, observed=True)[
    "Population"
].sum()
msa_totals["Race/Sex Indicator"] = "MSA Population"

# calculate gender totals
male_mask = rsi_norm.str.endswith(" male")
female_mask = rsi_norm.str.endswith(" female")

total_male = (
    long_df.loc[male_mask]
    .groupby(id_vars + ["AGEGRP"], as_index=False, observed=True)["Population"]
    .sum()
)
total_male["Race/Sex Indicator"] = "Total male"
total_male["Race/Sex Indicator"]
total_female = (
    long_df.loc[female_mask]
    .groupby(id_vars + ["AGEGRP"], as_index=False, observed=True)["Population"]
    .sum()
)
total_female["Race/Sex Indicator"] = "Total female"

# append the computed categories
long_augmented = pd.concat(
    [long_df, msa_totals, total_male, total_female], ignore_index=True
)

# each Race/Sex Indicator (incl. MSA Population) becomes a column
pop_1980_wide = long_augmented.pivot_table(
    index=id_vars + ["AGEGRP"],
    columns="Race/Sex Indicator",
    values="Population",
    aggfunc="sum",  # safe if duplicates exist
).reset_index()
pop_1980_wide.columns.name = None

# turn each age group into integer; 0 for "Total Population"
age_id_map = {name: i for i, name in enumerate(age_groups_with_total)}
pop_1980_wide["AGEGRP"] = pop_1980_wide["AGEGRP"].map(age_id_map).astype("Int64")

# Put key aggregates first if present
race_cols = [c for c in pop_1980_wide.columns if c not in id_vars + ["AGEGRP"]]
preferred = [
    c for c in ["MSA Population", "Total male", "Total female"] if c in race_cols
]
others = [c for c in race_cols if c not in preferred]
race_cols = preferred + others

final_pop_1980 = (
    pop_1980_wide.sort_values(id_vars + ["AGEGRP"]).reset_index(drop=True)
)[id_vars + ["AGEGRP"] + race_cols]

# final_df is your result
final_pop_1980.head(20)

,Year of Estimate,FIPS State and County Codes,metro13,metro_title,AGEGRP,MSA Population,Total male,Total female,Black female,Black male,Other races female,Other races male,White female,White male
0,1980.0,12085.0,10420,"Akron, OH",0,64964.0,31748.0,33216.0,2496.0,2414.0,152.0,142.0,30568.0,29192.0
1,1980.0,12085.0,10420,"Akron, OH",1,3143.0,1589.0,1554.0,256.0,244.0,7.0,9.0,1291.0,1336.0
2,1980.0,12085.0,10420,"Akron, OH",2,3501.0,1805.0,1696.0,239.0,259.0,10.0,6.0,1447.0,1540.0
3,1980.0,12085.0,10420,"Akron, OH",3,3958.0,2045.0,1913.0,245.0,277.0,16.0,7.0,1652.0,1761.0
4,1980.0,12085.0,10420,"Akron, OH",4,4670.0,2452.0,2218.0,292.0,270.0,14.0,22.0,1912.0,2160.0
5,1980.0,12085.0,10420,"Akron, OH",5,4431.0,2346.0,2085.0,257.0,234.0,12.0,17.0,1816.0,2095.0
6,1980.0,12085.0,10420,"Akron, OH",6,3968.0,2054.0,1914.0,159.0,175.0,12.0,14.0,1743.0,1865.0
7,1980.0,12085.0,10420,"Akron, OH",7,3901.0,1967.0,1934.0,181.0,155.0,18.0,13.0,1735.0,1799.0
8,1980.0,12085.0,10420,"Akron, OH",8,3300.0,1644.0,1656.0,122.0,130.0,12.0,8.0,1522.0,1506.0
9,1980.0,12085.0,10420,"Akron, OH",9,2843.0,1420.0,1423.0,118.0,111.0,13.0,4.0,1292.0,1305.0
10,1980.0,12085.0,10420,"Akron, OH",10,2751.0,1377.0,1374.0,103.0,103.0,15.0,5.0,1256.0,1269.0
11,1980.0,12085.0,10420,"Akron, OH",11,3226.0,1503.0,1723.0,108.0,96.0,3.0,17.0,1612.0,1390.0
12,1980.0,12085.0,10420,"Akron, OH",12,4144.0,1772.0,2372.0,96.0,87.0,1.0,4.0,2275.0,1681.0
13,1980.0,12085.0,10420,"Akron, OH",13,5199.0,2319.0,2880.0,92.0,88.0,2.0,6.0,2786.0,2225.0
14,1980.0,12085.0,10420,"Akron, OH",14,5642.0,2621.0,3021.0,80.0,71.0,6.0,4.0,2935.0,2546.0
15,1980.0,12085.0,10420,"Akron, OH",15,4831.0,2292.0,2539.0,65.0,47.0,2.0,2.0,2472.0,2243.0
16,1980.0,12085.0,10420,"Akron, OH",16,3115.0,1517.0,1598.0,46.0,43.0,4.0,2.0,1548.0,1472.0
17,1980.0,12085.0,10420,"Akron, OH",17,1517.0,699.0,818.0,24.0,16.0,3.0,0.0,791.0,683.0
18,1980.0,12085.0,10420,"Akron, OH",18,824.0,326.0,498.0,13.0,8.0,2.0,2.0,483.0,316.0
19,1980.0,12117.0,10580,"Albany-Schenectady-Troy, NY",0,182019.0,88004.0,94015.0,9814.0,8307.0,943.0,804.0,83258.0,78893.0

In [2229]:
# rename columns to match 2022
final_pop_1980 = final_pop_1980.rename(
    columns={
        "MSA Population": "TOT_POP",
        "Total male": "TOT_MALE",
        "Total female": "TOT_FEMALE",
        "Black female": "BAC_FEMALE",
        "Black male": "BAC_MALE",
        "Other races female": "OTHER_FEMALE",
        "Other races male": "OTHER_MALE",
        "White female": "WAC_FEMALE",
        "White male": "WAC_MALE",
        "Year of Estimate": "year",
    }
)
final_pop_1980

,year,FIPS State and County Codes,metro13,metro_title,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,BAC_FEMALE,BAC_MALE,OTHER_FEMALE,OTHER_MALE,WAC_FEMALE,WAC_MALE
0,1980.0,12085.0,10420,"Akron, OH",0,64964.0,31748.0,33216.0,2496.0,2414.0,152.0,142.0,30568.0,29192.0
1,1980.0,12085.0,10420,"Akron, OH",1,3143.0,1589.0,1554.0,256.0,244.0,7.0,9.0,1291.0,1336.0
2,1980.0,12085.0,10420,"Akron, OH",2,3501.0,1805.0,1696.0,239.0,259.0,10.0,6.0,1447.0,1540.0
3,1980.0,12085.0,10420,"Akron, OH",3,3958.0,2045.0,1913.0,245.0,277.0,16.0,7.0,1652.0,1761.0
4,1980.0,12085.0,10420,"Akron, OH",4,4670.0,2452.0,2218.0,292.0,270.0,14.0,22.0,1912.0,2160.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
888,1980.0,51069.0,49340,"Worcester, MA-CT",14,1089.0,565.0,524.0,6.0,10.0,1.0,1.0,517.0,554.0
889,1980.0,51069.0,49340,"Worcester, MA-CT",15,756.0,353.0,403.0,5.0,2.0,0.0,1.0,398.0,350.0
890,1980.0,51069.0,49340,"Worcester, MA-CT",16,477.0,207.0,270.0,4.0,7.0,0.0,0.0,266.0,200.0
891,1980.0,51069.0,49340,"Worcester, MA-CT",17,275.0,116.0,159.0,4.0,4.0,1.0,0.0,154.0,112.0
892,1980.0,51069.0,49340,"Worcester, MA-CT",18,221.0,68.0,153.0,3.0,0.0,0.0,0.0,150.0,68.0

## 2022

### data wrangling

codebook: https://www2.census.gov/programs-surveys/popest/technical-documentation/file-layouts/2020-2023/CBSA-EST2023-ALLDATA-CHAR.pdf

In [2230]:
pop2 = pd.read_csv("../../data/pop_2022.csv", encoding="latin1").drop(
    columns=["MDIV", "LSAD", "SUMLEV"]
)
pop2 = pop2.query(
    "`YEAR` == 4"
)  # 1 = 4/1/2020 population estimates, 2 = 7/1/2020, 3 = 7/1/2021, 4 = 7/1/2022, 5 = 7/1/2023
pop2 = pop2.drop(columns=["YEAR"])
pop2

,CBSA,NAME,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,WA_MALE,WA_FEMALE,BA_MALE,BA_FEMALE,...,HWAC_MALE,HWAC_FEMALE,HBAC_MALE,HBAC_FEMALE,HIAC_MALE,HIAC_FEMALE,HAAC_MALE,HAAC_FEMALE,HNAC_MALE,HNAC_FEMALE
57,10180,"Abilene, TX",0,179665,91450,88215,76766,76213,9412,6473,...,20990,19398,1229,1104,852,769,341,234,132,105
58,10180,"Abilene, TX",1,11307,5862,5445,4713,4344,668,631,...,1724,1524,151,163,53,40,20,20,9,13
59,10180,"Abilene, TX",2,11934,5980,5954,4944,4920,524,527,...,1667,1790,146,143,60,71,34,29,9,3
60,10180,"Abilene, TX",3,11716,5951,5765,4930,4750,568,526,...,1797,1717,118,134,63,69,31,32,11,14
61,10180,"Abilene, TX",4,13387,6902,6485,5775,5459,653,591,...,1946,1817,120,137,57,73,26,35,13,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
91366,49820,"Zapata, TX",14,525,261,264,251,261,4,0,...,227,235,2,0,2,0,0,0,0,0
91367,49820,"Zapata, TX",15,506,226,280,221,271,2,1,...,178,234,1,0,2,2,0,0,0,0
91368,49820,"Zapata, TX",16,366,171,195,169,190,1,0,...,137,172,0,0,0,1,0,0,0,0
91369,49820,"Zapata, TX",17,279,146,133,143,131,1,0,...,125,105,0,0,2,0,0,1,0,0
91370,49820,"Zapata, TX",18,171,83,88,80,84,1,1,...,47,54,0,0,0,0,0,0,0,0

In [2231]:
# keep only rows relevant to bfi dataset
merged_pop_2022 = pop2.merge(
    bfi_df[["metro13", "metro_title"]],
    left_on="CBSA",
    right_on="metro13",
    how="inner",
).drop(columns=["CBSA", "NAME"])
merged_pop_2022

,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,WA_MALE,WA_FEMALE,BA_MALE,BA_FEMALE,IA_MALE,IA_FEMALE,...,HBAC_MALE,HBAC_FEMALE,HIAC_MALE,HIAC_FEMALE,HAAC_MALE,HAAC_FEMALE,HNAC_MALE,HNAC_FEMALE,metro13,metro_title
0,0,697511,340470,357041,274240,283462,42224,48769,689,791,...,1243,1385,351,428,214,209,106,96,10420,"Akron, OH"
1,1,35331,17932,17399,12431,11813,3124,3249,24,39,...,150,170,34,51,30,27,8,10,10420,"Akron, OH"
2,2,38893,19771,19122,13812,13103,3488,3493,38,41,...,175,197,36,43,42,19,20,15,10420,"Akron, OH"
3,3,40363,20575,19788,14756,14131,3553,3440,33,28,...,165,139,33,24,17,24,18,12,10420,"Akron, OH"
4,4,43776,21969,21807,16630,16243,3318,3447,37,52,...,116,147,34,47,14,25,11,12,10420,"Akron, OH"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2503,14,50333,24611,25722,22730,23687,900,909,93,104,...,176,193,73,69,14,14,6,6,49340,"Worcester, MA-CT"
2504,15,38465,18272,20193,17106,18766,519,591,51,39,...,81,125,36,15,3,5,1,7,49340,"Worcester, MA-CT"
2505,16,26576,12204,14372,11535,13457,272,356,38,28,...,58,85,16,18,6,5,2,2,49340,"Worcester, MA-CT"
2506,17,15848,6558,9290,6195,8668,95,217,18,26,...,33,35,8,18,3,4,2,1,49340,"Worcester, MA-CT"
2507,18,15892,5380,10512,5051,10060,95,143,22,42,...,16,40,4,22,0,6,1,3,49340,"Worcester, MA-CT"

In [2232]:
# organize to look lik 1980 data
min_df_2022 = merged_pop_2022.query("`AGEGRP` == 0")
min_df_2022 = min_df_2022[
    [
        "metro13",
        "metro_title",
        "TOT_POP",
        "TOT_MALE",
        "TOT_FEMALE",
        "WAC_MALE",
        "WAC_FEMALE",
        "BAC_MALE",
        "BAC_FEMALE",
    ]
]
min_df_2022["OTHER_MALE"] = merged_pop_2022[
    ["IAC_MALE", "AAC_MALE", "NAC_MALE", "H_MALE"]
].sum(axis=1)
min_df_2022["OTHER_FEMALE"] = merged_pop_2022[
    ["IAC_FEMALE", "AAC_FEMALE", "NAC_FEMALE", "H_FEMALE"]
].sum(axis=1)
min_df_2022

,metro13,metro_title,TOT_POP,TOT_MALE,TOT_FEMALE,WAC_MALE,WAC_FEMALE,BAC_MALE,BAC_FEMALE,OTHER_MALE,OTHER_FEMALE
0,10420,"Akron, OH",697511,340470,357041,283032,292666,48263,55181,28317,28991
19,10580,"Albany-Schenectady-Troy, NY",903595,444908,458687,376888,387186,49961,52717,60323,61017
38,10740,"Albuquerque, NM",920138,453849,466289,387217,396806,22776,20263,280626,292251
57,10900,"Allentown-Bethlehem-Easton, PA-NJ",870570,430821,439749,372434,381962,45722,45779,111054,110572
76,12060,"Atlanta-Sandy Springs-Roswell, GA",6238676,3026811,3211865,1742669,1753778,1089376,1260024,672513,664940
...,...,...,...,...,...,...,...,...,...,...,...
2413,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",1340607,655375,685232,437406,445414,132463,145369,240697,248433
2432,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",1788040,858316,929724,346238,336201,476844,553959,223829,218129
2451,48620,"Wichita, KS",649687,323930,325757,280340,281438,32740,32296,73607,72626
2470,49180,"Winston-Salem, NC",688799,333034,355765,260295,271780,66148,76734,56856,57616
2489,49340,"Worcester, MA-CT",862873,428468,434405,371370,377521,36689,35478,90741,91948

In [2233]:
msa_tables_2022 = {}

agg_cols = [
    "TOT_POP",
    "TOT_MALE",
    "TOT_FEMALE",
    "WAC_MALE",
    "BAC_MALE",
    "OTHER_MALE",
    "WAC_FEMALE",
    "BAC_FEMALE",
    "OTHER_FEMALE",
]
msa_totals = min_df_2022.groupby("metro_title", as_index=False)[agg_cols].sum()

# male race shares within each MSA
male_props = msa_totals[
    ["metro_title", "WAC_MALE", "BAC_MALE", "OTHER_MALE", "TOT_MALE"]
].copy()
male_props[["White", "Black", "Other"]] = male_props[
    ["WAC_MALE", "BAC_MALE", "OTHER_MALE"]
].div(male_props["TOT_MALE"], axis=0)
male_props = male_props[["metro_title", "White", "Black", "Other"]].rename_axis(
    None, axis=1
)

# female race shares within each MSA
female_props = msa_totals[
    ["metro_title", "WAC_FEMALE", "BAC_FEMALE", "OTHER_FEMALE", "TOT_FEMALE"]
].copy()
female_props[["White", "Black", "Other"]] = female_props[
    ["WAC_FEMALE", "BAC_FEMALE", "OTHER_FEMALE"]
].div(female_props["TOT_FEMALE"], axis=0)
female_props = female_props[["metro_title", "White", "Black", "Other"]].rename_axis(
    None, axis=1
)


for msa in msa_totals["metro_title"]:
    male_row = male_props.loc[
        male_props["metro_title"] == msa, ["White", "Black", "Other"]
    ].squeeze()
    female_row = female_props.loc[
        female_props["metro_title"] == msa, ["White", "Black", "Other"]
    ].squeeze()

    proportions = pd.DataFrame(
        [male_row.to_numpy(), female_row.to_numpy()],
        index=["Male", "Female"],
        columns=["White", "Black", "Other"],
    ).astype(float)
    proportions = (proportions * 100).round(2)
    msa_tables_2022[msa] = proportions

    print(f"\n=== {msa} ===")
    print(proportions)

=== Akron, OH ===
        White  Black  Other
Male    83.13  14.18   8.32
Female  81.97  15.46   8.12

=== Albany-Schenectady-Troy, NY ===
        White  Black  Other
Male    84.71  11.23  13.56
Female  84.41  11.49  13.30

=== Albuquerque, NM ===
        White  Black  Other
Male    85.32   5.02  61.83
Female  85.10   4.35  62.68

=== Allentown-Bethlehem-Easton, PA-NJ ===
        White  Black  Other
Male    86.45  10.61  25.78
Female  86.86  10.41  25.14

=== Atlanta-Sandy Springs-Roswell, GA ===
        White  Black  Other
Male    57.57  35.99  22.22
Female  54.60  39.23  20.70

=== Augusta-Richmond County, GA-SC ===
        White  Black  Other
Male    61.19  37.35  11.63
Female  58.56  39.73  10.80

=== Austin-Round Rock, TX ===
        White  Black  Other
Male    82.29   9.49  43.61
Female  82.36   9.50  43.13

=== Bakersfield, CA ===
        White  Black  Other
Male    84.61   7.56  68.26
Female  84.63   7.24  67.97

=== Baltimore-Columbia-Towson, MD ===
        White  Black  Other
Male    63.70  30.75  17.47
Female  60.83  33.67  16.46

=== Baton Rouge, LA ===
        White  Black  Other
Male    61.88  36.04  10.72
Female  59.94  38.14   9.66

=== Birmingham-Hoover, AL ===
        White  Black  Other
Male    69.55  28.99   9.47
Female  67.31  31.18   8.52

=== Boise City, ID ===
        White  Black  Other
Male    94.85   2.18  21.64
Female  94.82   1.82  21.36

=== Boston-Cambridge-Newton, MA-NH ===
        White  Black  Other
Male    80.17  11.39  23.98
Female  79.78  11.49  23.69

=== Bridgeport-Stamford-Norwalk, CT ===
        White  Black  Other
Male    80.43  14.15  30.99
Female  79.16  15.24  30.17

=== Buffalo-Cheektowaga-Niagara Falls, NY ===
        White  Black  Other
Male    82.55  13.63  12.39
Female  81.39  14.85  12.27

=== Cape Coral-Fort Myers, FL ===
        White  Black  Other
Male    88.22  10.34  28.31
Female  87.96  10.34  27.10

=== Charleston-North Charleston, SC ===
        White  Black  Other
Male    73.18  24.98  12.71
Female  71.03  27.01  11.82

=== Charlotte-Concord-Gastonia, NC-SC ===
        White  Black  Other
Male    71.13  24.42  19.91
Female  69.17  26.70  18.72

=== Chicago-Naperville-Elgin, IL-IN-WI ===
        White  Black  Other
Male    75.46  17.02  34.83
Female  73.09  19.21  33.29

=== Cincinnati, OH-KY-IN ===
        White  Black  Other
Male    83.61  14.10   9.56
Female  82.89  14.94   9.11

=== Colorado Springs, CO ===
        White  Black  Other
Male    87.80   9.54  26.90
Female  87.73   8.64  27.98

=== Columbia, SC ===
        White  Black  Other
Male    62.82  35.06  12.21
Female  60.19  37.89  10.96

=== Columbus, OH ===
        White  Black  Other
Male    77.05  19.01  13.09
Female  76.56  19.45  12.67

=== Dallas-Fort Worth-Arlington, TX ===
        White  Black  Other
Male    73.51  17.89  41.64
Female  71.89  19.62  40.03

=== Deltona-Daytona Beach-Ormond Beach, FL ===
        White  Black  Other
Male    85.60  12.94  19.87
Female  85.15  13.23  19.37

=== Denver-Aurora-Lakewood, CO ===
        White  Black  Other
Male    86.73   8.02  33.03
Female  86.51   7.64  33.46

=== Des Moines-West Des Moines, IA ===
        White  Black  Other
Male    88.42   7.86  15.23
Female  89.18   7.05  14.51

=== Detroit-Warren-Dearborn, MI ===
        White  Black  Other
Male    73.02  22.46  12.86
Female  70.54  25.21  12.22

=== El Paso, TX ===
        White  Black  Other
Male    91.96   5.84  85.03
Female  93.27   4.47  88.54

=== Fayetteville-Springdale-Rogers, AR-MO ===
        White  Black  Other
Male    88.88   4.18  28.60
Female  90.10   3.74  27.15

=== Fresno, CA ===
        White  Black  Other
Male    79.53   6.69  73.30
Female  79.46   6.86  72.13

=== Grand Rapids-Wyoming, MI ===
        White  Black  Other
Male    88.58   9.47  15.23
Female  89.32   8.48  15.01

=== Greensboro-High Point, NC ===
        White  Black  Other
Male    66.58  29.33  17.89
Female  64.60  31.64  16.56

=== Greenville-Anderson-Mauldin, SC ===
        White  Black  Other
Male    81.12  17.29  13.24
Female  79.96  18.47  12.21

=== Harrisburg-Carlisle, PA ===
        White  Black  Other
Male    81.33  13.96  16.11
Female  81.95  13.59  15.58

=== Hartford-West Hartford-East Hartford, CT ===
        White  Black  Other
Male    79.72  14.85  24.58
Female  79.65  15.40  24.18

=== Houston-The Woodlands-Sugar Land, TX ===
        White  Black  Other
Male    72.14  18.96  50.20
Female  70.01  20.87  48.59

=== Indianapolis-Carmel-Anderson, IN ===
        White  Black  Other
Male    79.05  17.63  15.39
Female  78.17  18.77  14.42

=== Jacksonville, FL ===
        White  Black  Other
Male    73.29  23.15  18.13
Female  71.56  24.58  17.73

=== Kansas City, MO-KS ===
        White  Black  Other
Male    83.23  14.11  17.34
Female  82.65  14.69  16.57

=== Knoxville, TN ===
        White  Black  Other
Male    91.65   7.07   9.28
Female  91.68   7.03   8.75

=== Lakeland-Winter Haven, FL ===
        White  Black  Other
Male    80.04  18.60  34.21
Female  79.65  18.87  32.74

=== Las Vegas-Henderson-Paradise, NV ===
        White  Black  Other
Male    73.10  15.78  49.44
Female  70.38  16.46  50.94

=== Little Rock-North Little Rock-Conway, AR ===
        White  Black  Other
Male    73.87  24.64  11.76
Female  71.38  26.96  10.63

=== Los Angeles-Long Beach-Anaheim, CA ===
        White  Black  Other
Male    73.67   8.19  67.37
Female  71.77   8.60  68.00

=== Louisville/Jefferson County, KY-IN ===
        White  Black  Other
Male    82.33  16.42  11.17
Female  81.47  17.31  10.32

=== Madison, WI ===
        White  Black  Other
Male    88.62   6.66  15.06
Female  88.79   6.48  14.38

=== McAllen-Edinburg-Mission, TX ===
        White  Black  Other
Male    96.95   1.39  93.79
Female  97.29   1.07  94.53

=== Memphis, TN-MS-AR ===
        White  Black  Other
Male    50.52  47.37  12.09
Female  47.15  50.85  10.65

=== Miami-Fort Lauderdale-West Palm Beach, FL ===
        White  Black  Other
Male    74.68  22.88  50.69
Female  73.55  23.91  50.86

=== Milwaukee-Waukesha-West Allis, WI ===
        White  Black  Other
Male    78.57  17.45  19.24
Female  76.88  19.21  18.42

=== Minneapolis-St. Paul-Bloomington, MN-WI ===
        White  Black  Other
Male    81.36  11.88  17.24
Female  81.35  11.63  16.99

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===
        White  Black  Other
Male    81.34  15.99  15.80
Female  80.22  17.13  14.79

=== New Haven-Milford, CT ===
        White  Black  Other
Male    78.39  17.57  26.95
Female  77.45  18.48  26.32

=== New Orleans-Metairie, LA ===
        White  Black  Other
Male    56.54  39.95  19.35
Female  53.22  43.47  17.50

=== New York-Newark-Jersey City, NY-NJ-PA ===
        White  Black  Other
Male    66.76  20.54  41.61
Female  65.02  22.18  41.01

=== North Port-Sarasota-Bradenton, FL ===
        White  Black  Other
Male    90.31   7.87  18.49
Female  90.09   7.82  17.63

=== Ogden-Clearfield, UT ===
        White  Black  Other
Male    94.50   2.69  20.93
Female  94.47   2.23  20.93

=== Oklahoma City, OK ===
        White  Black  Other
Male    80.04  12.97  29.49
Female  79.38  13.25  28.82

=== Omaha-Council Bluffs, NE-IA ===
        White  Black  Other
Male    87.07   9.67  18.98
Female  86.87   9.79  18.30

=== Orlando-Kissimmee-Sanford, FL ===
        White  Black  Other
Male    75.79  20.02  40.42
Female  74.81  20.69  40.28

=== Oxnard-Thousand Oaks-Ventura, CA ===
        White  Black  Other
Male    87.13   3.58  58.24
Female  86.62   3.16  58.26

=== Palm Bay-Melbourne-Titusville, FL ===
        White  Black  Other
Male    85.69  12.53  17.31
Female  84.83  12.82  17.66

=== Philadelphia-Camden-Wilmington, PA-NJ-DE-MD ===
        White  Black  Other
Male    70.87  23.04   20.1
Female  69.03  24.90   19.4

=== Phoenix-Mesa-Scottsdale, AZ ===
        White  Black  Other
Male    84.66   8.40  41.98
Female  84.58   8.18  41.51

=== Pittsburgh, PA ===
        White  Black  Other
Male    88.47   9.85   6.58
Female  88.18  10.29   6.20

=== Portland-Vancouver-Hillsboro, OR-WA ===
        White  Black  Other
Male    86.46   5.24  27.93
Female  86.15   4.73  27.74

=== Providence-Warwick, RI-MA ===
        White  Black  Other
Male    86.35  10.66  21.59
Female  86.69  10.22  20.71

=== Provo-Orem, UT ===
        White  Black  Other
Male    94.97   1.72  21.02
Female  94.98   1.57  20.81

=== Raleigh, NC ===
        White  Black  Other
Male    71.66  21.21  22.81
Female  70.08  23.18  21.78

=== Richmond, VA ===
        White  Black  Other
Male    65.79  30.19  16.02
Female  63.49  32.61  14.82

=== Riverside-San Bernardino-Ontario, CA ===
        White  Black  Other
Male    80.62   9.84  67.17
Female  79.66  10.04  67.36

=== Rochester, NY ===
        White  Black  Other
Male    83.99  13.90  13.77
Female  83.04  14.79  13.46

=== Sacramento--Roseville--Arden-Arcade, CA ===
        White  Black  Other
Male    73.58   10.3  46.52
Female  72.78   10.2  46.51

=== Salt Lake City, UT ===
        White  Black  Other
Male    89.65   3.44  30.44
Female  89.75   2.96  30.39

=== San Antonio-New Braunfels, TX ===
        White  Black  Other
Male    86.79   9.63  60.76
Female  86.86   9.23  61.76

=== San Diego-Carlsbad, CA ===
        White  Black  Other
Male    79.16   7.47  53.00
Female  78.32   6.68  55.53

=== San Francisco-Oakland-Hayward, CA ===
        White  Black  Other
Male    61.62   9.29  58.61
Female  59.15   9.43  60.13

=== San Jose-Sunnyvale-Santa Clara, CA ===
        White  Black  Other
Male    55.53   3.94  71.50
Female  54.50   3.66  73.02

=== Seattle-Tacoma-Bellevue, WA ===
        White  Black  Other
Male    73.57   9.42  35.86
Female  72.90   8.68  36.64

=== Spokane-Spokane Valley, WA ===
        White  Black  Other
Male    92.25   4.08  15.72
Female  92.59   3.36  15.71

=== Springfield, MA ===
        White  Black  Other
Male    84.56  13.75  32.02
Female  84.35  13.65  32.48

=== St. Louis, MO-IL ===
        White  Black  Other
Male    79.30  18.49   8.94
Female  77.06  20.65   8.47

=== Stockton-Lodi, CA ===
        White  Black  Other
Male    68.59   9.94  71.08
Female  67.91  10.17  70.16

=== Syracuse, NY ===
        White  Black  Other
Male    86.71  11.05  10.68
Female  86.17  11.37  10.60

=== Tampa-St. Petersburg-Clearwater, FL ===
        White  Black  Other
Male    81.85  14.97  28.24
Female  81.11  15.46  27.51

=== Toledo, OH ===
        White  Black  Other
Male    82.74  17.14  11.52
Female  81.68  18.15  11.21

=== Tucson, AZ ===
        White  Black  Other
Male    86.89   6.22  46.72
Female  87.27   5.33  47.56

=== Tulsa, OK ===
        White  Black  Other
Male    78.81  10.28  31.34
Female  78.34  10.67  30.44

=== Urban Honolulu, HI ===
        White  Black   Other
Male    40.90   4.85   96.81
Female  35.97   3.46  101.75

=== Virginia Beach-Norfolk-Newport News, VA-NC ===
        White  Black  Other
Male    64.39  32.57  16.02
Female  61.29  35.17  15.76

=== Washington-Arlington-Alexandria, DC-VA-MD-WV ===
        White  Black  Other
Male     61.8  27.59  33.46
Female   59.1  29.65  32.63

=== Wichita, KS ===
        White  Black  Other
Male    86.54  10.11  22.72
Female  86.40   9.91  22.29

=== Winston-Salem, NC ===
        White  Black  Other
Male    78.16  19.86  17.07
Female  76.39  21.57  16.19

=== Worcester, MA-CT ===
        White  Black  Other
Male    86.67   8.56  21.18
Female  86.91   8.17  21.17

# Employment

In [2234]:
ind_1980 = pd.read_csv("../../data/labor_1980.csv").drop(
    columns=["own_code", "industry_code", "qtr"]
)
ind_1980["area_fips"] = pd.to_numeric(ind_1980["area_fips"], errors="coerce")
ind_1980

,area_fips,agglvl_code,size_code,year,disclosure_code,area_title,own_title,industry_title,agglvl_title,size_title,annual_avg_estabs_count,annual_avg_emplvl,total_annual_wages,taxable_annual_wages,annual_contributions,annual_avg_wkly_wage,avg_annual_pay
0,NaN,1,0,1980,NaN,U.S. TOTAL,Total Covered,All Industries,"National, Total Covered",All establishment sizes,4727300,89183700,1282196041100,454357237100,10737989200,276,14377
1,1000.0,18,0,1980,NaN,Alabama -- Statewide,Total Covered,All Industries,"State, Total Covered",All establishment sizes,68280,1319928,17033276439,6610136205,140947633,248,12904
2,1001.0,26,0,1980,NaN,"Autauga County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,459,7986,111409756,0,0,268,13950
3,1003.0,26,0,1980,NaN,"Baldwin County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,1716,17387,174395507,0,0,192,10030
4,1005.0,26,0,1980,NaN,"Barbour County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,498,6549,67191094,0,0,197,10259
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17131,NaN,13,0,1980,NaN,"Worcester-Fitchburg-Leominster, Ma NECMA",Private,All Industries,"MSA, Total -- by ownership sector",All establishment sizes,10858,223693,2877532661,0,0,247,12863
17132,NaN,13,0,1980,NaN,"Yakima, Wa MSA",Private,All Industries,"MSA, Total -- by ownership sector",All establishment sizes,4130,52145,595190062,0,0,219,11414
17133,NaN,13,0,1980,NaN,"York, Pa MSA",Private,All Industries,"MSA, Total -- by ownership sector",All establishment sizes,6557,137615,1820909824,0,0,254,13231
17134,NaN,13,0,1980,NaN,"Youngstown-Warren, Oh MSA",Private,All Industries,"MSA, Total -- by ownership sector",All establishment sizes,9322,172050,2770426550,0,0,309,16102
17135,NaN,13,0,1980,NaN,"Yuba City, Ca MSA",Private,All Industries,"MSA, Total -- by ownership sector",All establishment sizes,2611,25300,293497746,0,0,223,11600

In [2235]:
ind_2022 = pd.read_csv("../../data/labor_2022.csv").drop(
    columns=["own_code", "industry_code", "qtr"]
)
ind_2022["area_fips"] = pd.to_numeric(ind_2022["area_fips"], errors="coerce")
ind_2022

/var/folders/hh/82nyt7ps5zv2b0h_h7smbbq80000gn/T/ipykernel_29781/3990203350.py:1: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  ind_2022 = pd.read_csv("../../data/labor_2022.csv").drop(

,area_fips,agglvl_code,size_code,year,disclosure_code,area_title,own_title,industry_title,agglvl_title,size_title,...,oty_total_annual_wages_chg,oty_total_annual_wages_pct_chg,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg
0,1000.0,50,0,2022,NaN,Alabama -- Statewide,Total Covered,"10 Total, all industries","State, Total Covered",All establishment sizes,...,9290719237,8.7,841800853,5.1,-48478330,-18.1,57,5.5,2951,5.4
1,1000.0,51,0,2022,NaN,Alabama -- Statewide,Federal Government,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,121139973,2.5,0,0.0,0,0.0,52,3.0,2691,3.0
2,1000.0,51,0,2022,NaN,Alabama -- Statewide,State Government,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,341991292,5.9,-15729,-3.6,-2004,-37.4,66,5.8,3478,5.8
3,1000.0,51,0,2022,NaN,Alabama -- Statewide,Local Government,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,701098314,7.0,4756021,3.5,-546597,-30.6,46,5.0,2390,5.0
4,1000.0,51,0,2022,NaN,Alabama -- Statewide,Private,"10 Total, all industries","State, Total -- by ownership sector",All establishment sizes,...,8126489658,9.4,837060561,5.1,-47929729,-18.0,59,5.7,3046,5.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19251,NaN,95,0,2022,NaN,U.S. TOTAL,Total Government,"10 Total, all industries",Total Government (U.S.),All establishment sizes,...,72190158731,5.3,2179138215,6.1,-51842769,-21.4,51,4.1,2641,4.1
19252,NaN,94,0,2022,NaN,U.S. TOTAL,Total U.I. Covered (Excludes Federal Government),"10 Total, all industries",Total U.I. Covered (U.S.),All establishment sizes,...,770328815924,8.1,162185375499,8.8,127404523,0.4,45,3.5,2375,3.5
19253,NaN,92,0,2022,NaN,U.S. Combined Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. CMSAs or all U.S. CSAs",All establishment sizes,...,535181314882,7.0,120077517928,8.5,51424249,0.2,39,2.9,2017,2.9
19254,NaN,91,0,2022,NaN,U.S. Metropolitan Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. MSAs",All establishment sizes,...,616603104921,7.2,132306819289,8.5,-51626434,-0.2,41,3.1,2089,3.0
19255,NaN,93,0,2022,NaN,U.S. Nonmetropolitan Area Counties (combined),Total Covered,"10 Total, all industries","Total, all U.S. non-MSA counties",All establishment sizes,...,162171651391,14.2,29878556210,10.8,179030957,3.8,84,7.6,4340,7.6

In [2236]:
all_ind = pd.concat([ind_1980, ind_2022])
all_ind

,area_fips,agglvl_code,size_code,year,disclosure_code,area_title,own_title,industry_title,agglvl_title,size_title,...,oty_total_annual_wages_chg,oty_total_annual_wages_pct_chg,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg
0,NaN,1,0,1980,NaN,U.S. TOTAL,Total Covered,All Industries,"National, Total Covered",All establishment sizes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1000.0,18,0,1980,NaN,Alabama -- Statewide,Total Covered,All Industries,"State, Total Covered",All establishment sizes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1001.0,26,0,1980,NaN,"Autauga County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1003.0,26,0,1980,NaN,"Baldwin County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1005.0,26,0,1980,NaN,"Barbour County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19251,NaN,95,0,2022,NaN,U.S. TOTAL,Total Government,"10 Total, all industries",Total Government (U.S.),All establishment sizes,...,7.219016e+10,5.3,2.179138e+09,6.1,-51842769.0,-21.4,51.0,4.1,2641.0,4.1
19252,NaN,94,0,2022,NaN,U.S. TOTAL,Total U.I. Covered (Excludes Federal Government),"10 Total, all industries",Total U.I. Covered (U.S.),All establishment sizes,...,7.703288e+11,8.1,1.621854e+11,8.8,127404523.0,0.4,45.0,3.5,2375.0,3.5
19253,NaN,92,0,2022,NaN,U.S. Combined Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. CMSAs or all U.S. CSAs",All establishment sizes,...,5.351813e+11,7.0,1.200775e+11,8.5,51424249.0,0.2,39.0,2.9,2017.0,2.9
19254,NaN,91,0,2022,NaN,U.S. Metropolitan Statistical Areas (combined),Total Covered,"10 Total, all industries","Total, all U.S. MSAs",All establishment sizes,...,6.166031e+11,7.2,1.323068e+11,8.5,-51626434.0,-0.2,41.0,3.1,2089.0,3.0
19255,NaN,93,0,2022,NaN,U.S. Nonmetropolitan Area Counties (combined),Total Covered,"10 Total, all industries","Total, all U.S. non-MSA counties",All establishment sizes,...,1.621717e+11,14.2,2.987856e+10,10.8,179030957.0,3.8,84.0,7.6,4340.0,7.6

In [2237]:
# add msa codes to each county
msa_all_ind = all_ind.merge(
    msa_county[["ssacounty", "fipscounty", "cbsaname"]],
    left_on="area_fips",
    right_on="fipscounty",
    how="inner",
).drop(columns=["fipscounty"])
msa_all_ind

,area_fips,agglvl_code,size_code,year,disclosure_code,area_title,own_title,industry_title,agglvl_title,size_title,...,oty_taxable_annual_wages_chg,oty_taxable_annual_wages_pct_chg,oty_annual_contributions_chg,oty_annual_contributions_pct_chg,oty_annual_avg_wkly_wage_chg,oty_annual_avg_wkly_wage_pct_chg,oty_avg_annual_pay_chg,oty_avg_annual_pay_pct_chg,ssacounty,cbsaname
0,1001.0,26,0,1980,NaN,"Autauga County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1000,"Montgomery, AL"
1,1003.0,26,0,1980,NaN,"Baldwin County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1010,NaN
2,1005.0,26,0,1980,NaN,"Barbour County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1020,NaN
3,1007.0,26,0,1980,NaN,"Bibb County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1030,"Birmingham-Hoover, AL"
4,1009.0,26,0,1980,NaN,"Blount County, Alabama",Total Covered,All Industries,"County, Total Covered",All establishment sizes,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1040,"Birmingham-Hoover, AL"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
31321,72153.0,70,0,2022,NaN,"Yauco Municipio, Puerto Rico",Total Covered,"10 Total, all industries","County, Total Covered",All establishment sizes,...,3752667.0,11.1,187995.0,23.3,35.0,8.2,1848.0,8.3,40770,"Yauco, PR"
31322,72153.0,71,0,2022,NaN,"Yauco Municipio, Puerto Rico",Federal Government,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,...,0.0,0.0,0.0,0.0,-7.0,-0.6,-382.0,-0.6,40770,"Yauco, PR"
31323,72153.0,71,0,2022,NaN,"Yauco Municipio, Puerto Rico",State Government,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,40770,"Yauco, PR"
31324,72153.0,71,0,2022,NaN,"Yauco Municipio, Puerto Rico",Local Government,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,40770,"Yauco, PR"
31325,72153.0,71,0,2022,NaN,"Yauco Municipio, Puerto Rico",Private,"10 Total, all industries","County, Total -- by ownership sector",All establishment sizes,...,3752667.0,11.1,187995.0,23.3,36.0,8.7,1888.0,8.8,40770,"Yauco, PR"

In [2238]:
# keep only rows relevant to bfi dataset
merged_all_ind = msa_all_ind.merge(
    bfi_df[["metro13", "metro_title"]],
    left_on="ssacounty",
    right_on="metro13",
    how="inner",
).drop(columns=["ssacounty", "cbsaname", "area_fips", "industry_title"])
merged_all_ind = merged_all_ind.query('`own_title` == "Total Covered"')

In [2239]:
merged_all_ind.columns

Index(['agglvl_code', 'size_code', 'year', 'disclosure_code', 'area_title',
       'own_title', 'agglvl_title', 'size_title', 'annual_avg_estabs_count',
       'annual_avg_emplvl', 'total_annual_wages', 'taxable_annual_wages',
       'annual_contributions', 'annual_avg_wkly_wage', 'avg_annual_pay',
       'lq_disclosure_code', 'lq_annual_avg_estabs_count',
       'lq_annual_avg_emplvl', 'lq_total_annual_wages',
       'lq_taxable_annual_wages', 'lq_annual_contributions',
       'lq_annual_avg_wkly_wage', 'lq_avg_annual_pay', 'oty_disclosure_code',
       'oty_annual_avg_estabs_count_chg',
       'oty_annual_avg_estabs_count_pct_chg', 'oty_annual_avg_emplvl_chg',
       'oty_annual_avg_emplvl_pct_chg', 'oty_total_annual_wages_chg',
       'oty_total_annual_wages_pct_chg', 'oty_taxable_annual_wages_chg',
       'oty_taxable_annual_wages_pct_chg', 'oty_annual_contributions_chg',
       'oty_annual_contributions_pct_chg', 'oty_annual_avg_wkly_wage_chg',
       'oty_annual_avg_wkly_wage_pct_chg', 'oty_avg_annual_pay_chg',
       'oty_avg_annual_pay_pct_chg', 'metro13', 'metro_title'],
      dtype='object')

In [2240]:
cols = [
    "metro13",
    "metro_title",
    "year",
    "annual_avg_estabs_count",
    "annual_avg_emplvl",
    "total_annual_wages",
    "annual_avg_wkly_wage",
]

agg_df = merged_all_ind.groupby(["metro13", "metro_title", "year"], as_index=False).agg(
    {
        "annual_avg_estabs_count": "sum",
        "annual_avg_emplvl": "sum",
        "total_annual_wages": "sum",
        "annual_avg_wkly_wage": "mean",
    }
)


msa_tables = {}

for msa, sub in agg_df.groupby("metro_title"):
    table = sub.set_index("year")[
        [
            "annual_avg_estabs_count",
            "annual_avg_emplvl",
            "total_annual_wages",
            "annual_avg_wkly_wage",
        ]
    ].T

    table.index = [
        "Average Establishments",
        "Average Employment (Jobs)",
        "Total Annual Wages ($)",
        "Average Weekly Wage ($)",
    ]

    if len(sub["year"].unique()) > 1:
        years = sorted(sub["year"].unique())
        y0, y1 = years[0], years[-1]
        table["% Change"] = ((table[y1] - table[y0]) / table[y0] * 100).round(2)

    msa_tables[msa] = table.round(2)


for msa, table in msa_tables.items():
    print(f"=== {msa} ===")
    display(table)

=== Akron, OH ===

year                              1980          2022  % Change
Average Establishments          1792.0  7.245000e+03    304.30
Average Employment (Jobs)      21380.0  7.307400e+04    241.79
Total Annual Wages ($)     273472988.0  4.004658e+09   1364.37
Average Weekly Wage ($)          245.0  1.054000e+03    330.20

=== Albany-Schenectady-Troy, NY ===

year                              1980          2022  % Change
Average Establishments          3199.0  1.766300e+04    452.14
Average Employment (Jobs)      44771.0  2.082610e+05    365.17
Total Annual Wages ($)     512399299.0  1.252418e+10   2344.22
Average Weekly Wage ($)          220.0  1.156000e+03    425.45

=== Boston-Cambridge-Newton, MA-NH ===

year                             1980         2022  % Change
Average Establishments          647.0        685.0      5.87
Average Employment (Jobs)      7132.0       7003.0     -1.81
Total Annual Wages ($)     77973289.0  311622664.0    299.65
Average Weekly Wage ($)         210.0        856.0    307.62

=== Bridgeport-Stamford-Norwalk, CT ===

year                             1980         2022  % Change
Average Establishments          127.0        166.0     30.71
Average Employment (Jobs)      1748.0       1737.0     -0.63
Total Annual Wages ($)     33989651.0  108589073.0    219.48
Average Weekly Wage ($)         373.0       1202.0    222.25

=== Buffalo-Cheektowaga-Niagara Falls, NY ===

year                              1980         2022  % Change
Average Establishments           615.0        710.0     15.45
Average Employment (Jobs)      10431.0      12516.0     19.99
Total Annual Wages ($)     135187970.0  597983927.0    342.34
Average Weekly Wage ($)          249.0        919.0    269.08

=== Charleston-North Charleston, SC ===

year                             1980         2022  % Change
Average Establishments          606.0        621.0      2.48
Average Employment (Jobs)      4639.0       6408.0     38.13
Total Annual Wages ($)     46297491.0  288921912.0    524.06
Average Weekly Wage ($)         191.0        867.0    353.93

=== Charlotte-Concord-Gastonia, NC-SC ===

year                             1980         2022  % Change
Average Establishments          685.0        870.0     27.01
Average Employment (Jobs)      5968.0      11710.0     96.21
Total Annual Wages ($)     63876461.0  667143403.0    944.43
Average Weekly Wage ($)         205.0       1096.0    434.63

=== Chicago-Naperville-Elgin, IL-IN-WI ===

year                             1980         2022  % Change
Average Establishments          546.0        482.0    -11.72
Average Employment (Jobs)      5051.0       5714.0     13.13
Total Annual Wages ($)     53226302.0  299852947.0    463.35
Average Weekly Wage ($)         202.0       1009.0    399.50

=== Cincinnati, OH-KY-IN ===

year                             1980         2022  % Change
Average Establishments          436.0        297.0    -31.88
Average Employment (Jobs)      4079.0       3143.0    -22.95
Total Annual Wages ($)     41484838.0  118005304.0    184.45
Average Weekly Wage ($)         195.0        722.0    270.26

=== Colorado Springs, CO ===

year                             1980        2022  % Change
Average Establishments          178.0       111.0    -37.64
Average Employment (Jobs)      1181.0      1058.0    -10.41
Total Annual Wages ($)     12569840.0  41316104.0    228.69
Average Weekly Wage ($)         204.0       751.0    268.14

=== Columbia, SC ===

year                             1980        2022  % Change
Average Establishments          323.0       263.0    -18.58
Average Employment (Jobs)      2706.0      2339.0    -13.56
Total Annual Wages ($)     27673918.0  94900093.0    242.92
Average Weekly Wage ($)         196.0       780.0    297.96

=== Columbus, OH ===

year                             1980          2022  % Change
Average Establishments          344.0  1.545000e+03    349.13
Average Employment (Jobs)      4557.0  2.909800e+04    538.53
Total Annual Wages ($)     48904133.0  1.483905e+09   2934.32
Average Weekly Wage ($)         206.0  9.810000e+02    376.21

=== Dallas-Fort Worth-Arlington, TX ===

year                             1980        2022  % Change
Average Establishments          183.0       221.0     20.77
Average Employment (Jobs)      2076.0      2170.0      4.53
Total Annual Wages ($)     19538995.0  84012805.0    329.98
Average Weekly Wage ($)         180.0       745.0    313.89

=== Dayton, OH ===

year                             1980         2022  % Change
Average Establishments          337.0        502.0     48.96
Average Employment (Jobs)      4821.0       5251.0      8.92
Total Annual Wages ($)     64956369.0  252982189.0    289.46
Average Weekly Wage ($)         259.0        927.0    257.92

=== Fresno, CA ===

year                            1980        2022  % Change
Average Establishments          91.0       184.0    102.20
Average Employment (Jobs)      788.0      1793.0    127.54
Total Annual Wages ($)     7553544.0  77140406.0    921.25
Average Weekly Wage ($)        184.0       828.0    350.00

=== Grand Rapids-Wyoming, MI ===

year                             1980        2022  % Change
Average Establishments          231.0       192.0    -16.88
Average Employment (Jobs)      1588.0      1446.0     -8.94
Total Annual Wages ($)     15276877.0  65652661.0    329.75
Average Weekly Wage ($)         185.0       873.0    371.89

=== Greensboro-High Point, NC ===

year                             1980         2022  % Change
Average Establishments          285.0        325.0     14.04
Average Employment (Jobs)      2965.0       3600.0     21.42
Total Annual Wages ($)     30681168.0  176914775.0    476.62
Average Weekly Wage ($)         198.0        945.0    377.27

=== Greenville-Anderson-Mauldin, SC ===

year                             1980         2022  % Change
Average Establishments          378.0        374.0     -1.06
Average Employment (Jobs)      3545.0       3710.0      4.65
Total Annual Wages ($)     34135305.0  164922443.0    383.14
Average Weekly Wage ($)         185.0        855.0    362.16

=== Harrisburg-Carlisle, PA ===

year                             1980         2022  % Change
Average Establishments          571.0        846.0     48.16
Average Employment (Jobs)      7574.0      12869.0     69.91
Total Annual Wages ($)     84122817.0  554637320.0    559.32
Average Weekly Wage ($)         213.0        829.0    289.20

=== Hartford-West Hartford-East Hartford, CT ===

year                             1980         2022  % Change
Average Establishments          470.0        938.0     99.57
Average Employment (Jobs)      5995.0      10911.0     82.00
Total Annual Wages ($)     57286071.0  426631290.0    644.74
Average Weekly Wage ($)         183.0        752.0    310.93

=== Indianapolis-Carmel-Anderson, IN ===

year                             1980        2022  % Change
Average Establishments          208.0       673.0    223.56
Average Employment (Jobs)      1804.0      2836.0     57.21
Total Annual Wages ($)     15652508.0  80404707.0    413.69
Average Weekly Wage ($)         166.0       545.0    228.31

=== Jacksonville, FL ===

year                             1980         2022  % Change
Average Establishments          503.0        867.0     72.37
Average Employment (Jobs)      4819.0       5984.0     24.18
Total Annual Wages ($)     64310853.0  259124638.0    302.93
Average Weekly Wage ($)         256.0        833.0    225.39

=== Kansas City, MO-KS ===

year                             1980        2022  % Change
Average Establishments          162.0       234.0     44.44
Average Employment (Jobs)      1505.0      1796.0     19.34
Total Annual Wages ($)     14906212.0  83592131.0    460.79
Average Weekly Wage ($)         190.0       895.0    371.05

=== Milwaukee-Waukesha-West Allis, WI ===

year                             1980         2022  % Change
Average Establishments          429.0        605.0     41.03
Average Employment (Jobs)      5278.0       6629.0     25.60
Total Annual Wages ($)     64873312.0  328523858.0    406.41
Average Weekly Wage ($)         236.0        953.0    303.81

=== Nashville-Davidson--Murfreesboro--Franklin, TN ===

year                             1980         2022  % Change
Average Establishments          364.0        766.0    110.44
Average Employment (Jobs)      5116.0      10004.0     95.54
Total Annual Wages ($)     48191282.0  433902434.0    800.38
Average Weekly Wage ($)         181.0        834.0    360.77

=== New Haven-Milford, CT ===

year                             1980         2022  % Change
Average Establishments          255.0        502.0     96.86
Average Employment (Jobs)      1904.0       5069.0    166.23
Total Annual Wages ($)     18846702.0  372072681.0   1874.21
Average Weekly Wage ($)         190.0       1412.0    643.16

=== New Orleans-Metairie, LA ===

year                             1980         2022  % Change
Average Establishments          538.0        668.0     24.16
Average Employment (Jobs)      5371.0       7706.0     43.47
Total Annual Wages ($)     59964818.0  389290032.0    549.20
Average Weekly Wage ($)         214.0        971.0    353.74

=== Ogden-Clearfield, UT ===

year                              1980         2022  % Change
Average Establishments           904.0       1113.0     23.12
Average Employment (Jobs)      13106.0      17825.0     36.01
Total Annual Wages ($)     171274159.0  966372630.0    464.23
Average Weekly Wage ($)          251.0       1043.0    315.54

=== Oklahoma City, OK ===

year                              1980         2022  % Change
Average Establishments          1762.0       1406.0    -20.20
Average Employment (Jobs)      28506.0      20808.0    -27.00
Total Annual Wages ($)     451716614.0  972325710.0    115.25
Average Weekly Wage ($)          304.0        899.0    195.72

=== Omaha-Council Bluffs, NE-IA ===

year                             1980         2022  % Change
Average Establishments          390.0        368.0     -5.64
Average Employment (Jobs)      4961.0       3485.0    -29.75
Total Annual Wages ($)     76835473.0  134941720.0     75.62
Average Weekly Wage ($)         297.0        745.0    150.84

=== Orlando-Kissimmee-Sanford, FL ===

year                              1980          2022  % Change
Average Establishments          1420.0  1.466000e+03      3.24
Average Employment (Jobs)      19414.0  2.408100e+04     24.04
Total Annual Wages ($)     237275224.0  1.151986e+09    385.51
Average Weekly Wage ($)          235.0  9.200000e+02    291.49

=== Oxnard-Thousand Oaks-Ventura, CA ===

year                             1980         2022  % Change
Average Establishments          440.0        879.0     99.77
Average Employment (Jobs)      7297.0      16582.0    127.24
Total Annual Wages ($)     68063775.0  747600866.0    998.38
Average Weekly Wage ($)         179.0        867.0    384.36

=== Palm Bay-Melbourne-Titusville, FL ===

year                             1980         2022  % Change
Average Establishments          137.0        252.0     83.94
Average Employment (Jobs)      1729.0       2938.0     69.92
Total Annual Wages ($)     16349791.0  129216910.0    690.33
Average Weekly Wage ($)         181.0        846.0    367.40

=== Phoenix-Mesa-Scottsdale, AZ ===

year                             1980         2022  % Change
Average Establishments          309.0        870.0    181.55
Average Employment (Jobs)      3758.0       7433.0     97.79
Total Annual Wages ($)     51789371.0  521485715.0    906.94
Average Weekly Wage ($)         265.0       1349.0    409.06

=== Pittsburgh, PA ===

year                             1980         2022  % Change
Average Establishments          705.0       1066.0     51.21
Average Employment (Jobs)      7520.0      10309.0     37.09
Total Annual Wages ($)     94179799.0  492841560.0    423.30
Average Weekly Wage ($)         240.0        919.0    282.92

=== Provo-Orem, UT ===

year                             1980         2022  % Change
Average Establishments          135.0        152.0     12.59
Average Employment (Jobs)      1431.0       1843.0     28.79
Total Annual Wages ($)     16009923.0  103645897.0    547.39
Average Weekly Wage ($)         215.0       1082.0    403.26

=== Raleigh, NC ===

year                              1980          2022  % Change
Average Establishments           276.0  4.950000e+02     79.35
Average Employment (Jobs)       8535.0  1.636100e+04     91.69
Total Annual Wages ($)     116796732.0  1.320858e+09   1030.90
Average Weekly Wage ($)          263.0  1.553000e+03    490.49

=== Richmond, VA ===

year                              2022
Average Establishments           296.0
Average Employment (Jobs)       6157.0
Total Annual Wages ($)     191007056.0
Average Weekly Wage ($)          597.0

=== Riverside-San Bernardino-Ontario, CA ===

year                             2022
Average Establishments          382.0
Average Employment (Jobs)      4116.0
Total Annual Wages ($)     85631561.0
Average Weekly Wage ($)         400.0

=== Rochester, NY ===

year                              2022
Average Establishments           270.0
Average Employment (Jobs)       8266.0
Total Annual Wages ($)     448911392.0
Average Weekly Wage ($)         1044.0

=== Spokane-Spokane Valley, WA ===

year                             1980         2022  % Change
Average Establishments          448.0        702.0     56.70
Average Employment (Jobs)      7125.0       9250.0     29.82
Total Annual Wages ($)     73710918.0  381353759.0    417.36
Average Weekly Wage ($)         198.0        793.0    300.51

=== Springfield, MA ===

year                             1980         2022  % Change
Average Establishments          332.0        557.0     67.77
Average Employment (Jobs)      5782.0       7680.0     32.83
Total Annual Wages ($)     61785887.0  317158761.0    413.32
Average Weekly Wage ($)         205.0        794.0    287.32

=== Stockton-Lodi, CA ===

year                              1980          2022  % Change
Average Establishments           882.0  2.322000e+03    163.27
Average Employment (Jobs)      15146.0  3.898300e+04    157.38
Total Annual Wages ($)     161181359.0  1.822040e+09   1030.43
Average Weekly Wage ($)          204.0  8.990000e+02    340.69

=== Syracuse, NY ===

year                             1980         2022  % Change
Average Establishments          437.0        951.0    117.62
Average Employment (Jobs)      5146.0      13738.0    166.96
Total Annual Wages ($)     58707089.0  807248953.0   1275.05
Average Weekly Wage ($)         219.0       1130.0    415.98

=== Tampa-St. Petersburg-Clearwater, FL ===

year                             1980        2022  % Change
Average Establishments           88.0       106.0     20.45
Average Employment (Jobs)       798.0       789.0     -1.13
Total Annual Wages ($)     10333616.0  49920409.0    383.09
Average Weekly Wage ($)         249.0      1216.0    388.35

=== Toledo, OH ===

year                              1980          2022  % Change
Average Establishments          3599.0  5.914000e+03     64.32
Average Employment (Jobs)      67211.0  1.203360e+05     79.04
Total Annual Wages ($)     808221512.0  6.532296e+09    708.23
Average Weekly Wage ($)          231.0  1.044000e+03    351.95

=== Tucson, AZ ===

year                             1980         2022  % Change
Average Establishments          370.0        834.0    125.41
Average Employment (Jobs)      3970.0       8198.0    106.50
Total Annual Wages ($)     56395875.0  423805768.0    651.48
Average Weekly Wage ($)         273.0        994.0    264.10

=== Tulsa, OK ===

year                             1980         2022  % Change
Average Establishments           73.0        442.0    505.48
Average Employment (Jobs)      1057.0       2872.0    171.71
Total Annual Wages ($)     13585043.0  146200962.0    976.19
Average Weekly Wage ($)         247.0        979.0    296.36

=== Winston-Salem, NC ===

year                            1980        2022  % Change
Average Establishments          54.0       242.0    348.15
Average Employment (Jobs)      613.0      1713.0    179.45
Total Annual Wages ($)     4873901.0  93519595.0   1818.78
Average Weekly Wage ($)        152.0      1050.0    590.79

=== Worcester, MA-CT ===

year                              1980          2022  % Change
Average Establishments           436.0  2.187000e+03    401.61
Average Employment (Jobs)       8445.0  3.684400e+04    336.28
Total Annual Wages ($)     105016175.0  2.112492e+09   1911.59
Average Weekly Wage ($)          239.0  1.103000e+03    361.51

# Merge into large dataset with BFI

In [2241]:
bfi_df1980 = bfi_df.copy()
bfi_df1980["year"] = 1980
bfi_df2022 = bfi_df.copy()
bfi_df2022["year"] = 2022
bfi_yrs = pd.concat([bfi_df1980, bfi_df2022])
print(bfi_yrs.head())
print(bfi_yrs.tail())

   metro13 metro_title  change_ln_population  not_lbfr_share_prime_change  \
0        1          AL              0.006923                     -0.01089
1        5          AR             -0.027700                     -0.02280
2        6          CA              0.360200                     -0.07647
3        8          CO              0.419600                     -0.09702
4       12          FL              0.463400                     -0.05614

   unemployed_share_prime_change  non_hc_share_prime_change  \
0                       -0.01635                  -0.020300
1                       -0.01652                  -0.009817
2                       -0.02523                   0.080720
3                       -0.01325                   0.087190
4                       -0.00591                   0.031780

   hc_emp_share_prime_change  manu_share_prime_change  \
0                    0.04754                -0.109100
1                    0.04915                -0.034590
2                    0.02098                -0.026890
3                    0.02308                 0.008112
4                    0.03028                -0.065120

   non_manu_share_prime_change  manufacturing_share_prime1980  ...  \
0                      0.13640                        0.24990  ...
1                      0.07392                        0.18920  ...
2                      0.12860                        0.07481  ...
3                      0.10220                        0.03467  ...
4                      0.12720                        0.09937  ...

   change_earnings  college1980  college2022  change_college  \
0           0.4585      0.07756       0.1600         0.08243
1           0.4778      0.07879       0.1613         0.08254
2           0.5453      0.13910       0.2361         0.09704
3           0.5516      0.15570       0.3569         0.20120
4           0.3837      0.14390       0.2902         0.14630

   healthcare_share_prime2022  healthcare_share_prime1980  \
0                     0.08564                     0.03810
1                     0.08988                     0.04074
2                     0.06424                     0.04326
3                     0.06779                     0.04471
4                     0.09054                     0.06027

   change_non_hc_share_lbfr  change_ln_non_hc  non_hc_manu_share_prime_change  \
0                  -0.05360           0.01936                        0.088800
1                  -0.05038           0.02297                        0.024760
2                  -0.02911           0.38450                        0.107610
3                  -0.02375           0.52890                        0.079078
4                  -0.03358           0.52410                        0.096890

   year
0  1980
1  1980
2  1980
3  1980
4  1980

[5 rows x 27 columns]
     metro13                                   metro_title  \
125    47260    Virginia Beach-Norfolk-Newport News, VA-NC
126    47900  Washington-Arlington-Alexandria, DC-VA-MD-WV
127    48620                                   Wichita, KS
128    49180                             Winston-Salem, NC
129    49340                              Worcester, MA-CT

     change_ln_population  not_lbfr_share_prime_change  \
125                0.3525                    -0.068140
126                0.6018                    -0.060330
127                0.3014                    -0.041580
128                0.4209                     0.003533
129                0.2309                    -0.049690

     unemployed_share_prime_change  non_hc_share_prime_change  \
125                      -0.000817                   0.031050
126                       0.002283                   0.037890
127                       0.019200                   0.006006
128                       0.004468                  -0.082680
129                       0.003451                   0.018820

     hc_emp_share_prime_change  manu_share_prime_change  \
125                    0.03791                -0.045280
126                    0.02016                -0.006818
127                    0.01637                -0.103900
128                    0.07468                -0.193400
129                    0.02742                -0.159300

     non_manu_share_prime_change  manufacturing_share_prime1980  ...  \
125                      0.11420                        0.10720  ...
126                      0.06487                        0.03223  ...
127                      0.12630                        0.24270  ...
128                      0.18540                        0.30930  ...
129                      0.20560                        0.25970  ...

     change_earnings  college1980  college2022  change_college  \
125           0.5376       0.1373       0.3181          0.1808
126           0.5548       0.2813       0.4991          0.2178
127           0.2752       0.1600       0.2932          0.1332
128           0.4411       0.1284       0.2859          0.1575
129           0.6015       0.1441       0.3408          0.1967

     healthcare_share_prime2022  healthcare_share_prime1980  \
125                     0.08881                     0.05090
126                     0.07075                     0.05059
127                     0.08197                     0.06561
128                     0.12600                     0.05134
129                     0.09974                     0.07232

     change_non_hc_share_lbfr  change_ln_non_hc  \
125                  -0.03976            0.3924
126                  -0.01901            0.6537
127                  -0.01459            0.3115
128                  -0.07418            0.3126
129                  -0.02726            0.3273

     non_hc_manu_share_prime_change  year
125                        0.076327  2022
126                        0.044705  2022
127                        0.109910  2022
128                        0.110719  2022
129                        0.178119  2022

[5 rows x 27 columns]

In [2242]:
# merge population dataframes
tot_final_pop_1980 = final_pop_1980.query("`AGEGRP` == 0")
min_df_2022["year"] = 2022
pop_df = pd.concat([final_pop_1980, min_df_2022], ignore_index=True, axis=0).drop(
    ["FIPS State and County Codes", "AGEGRP"], axis=1
)
pop_df

,year,metro13,metro_title,TOT_POP,TOT_MALE,TOT_FEMALE,BAC_FEMALE,BAC_MALE,OTHER_FEMALE,OTHER_MALE,WAC_FEMALE,WAC_MALE
0,1980.0,10420,"Akron, OH",64964.0,31748.0,33216.0,2496.0,2414.0,152.0,142.0,30568.0,29192.0
1,1980.0,10420,"Akron, OH",3143.0,1589.0,1554.0,256.0,244.0,7.0,9.0,1291.0,1336.0
2,1980.0,10420,"Akron, OH",3501.0,1805.0,1696.0,239.0,259.0,10.0,6.0,1447.0,1540.0
3,1980.0,10420,"Akron, OH",3958.0,2045.0,1913.0,245.0,277.0,16.0,7.0,1652.0,1761.0
4,1980.0,10420,"Akron, OH",4670.0,2452.0,2218.0,292.0,270.0,14.0,22.0,1912.0,2160.0
...,...,...,...,...,...,...,...,...,...,...,...,...
1020,2022.0,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",1340607.0,655375.0,685232.0,145369.0,132463.0,248433.0,240697.0,445414.0,437406.0
1021,2022.0,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",1788040.0,858316.0,929724.0,553959.0,476844.0,218129.0,223829.0,336201.0,346238.0
1022,2022.0,48620,"Wichita, KS",649687.0,323930.0,325757.0,32296.0,32740.0,72626.0,73607.0,281438.0,280340.0
1023,2022.0,49180,"Winston-Salem, NC",688799.0,333034.0,355765.0,76734.0,66148.0,57616.0,56856.0,271780.0,260295.0
1024,2022.0,49340,"Worcester, MA-CT",862873.0,428468.0,434405.0,35478.0,36689.0,91948.0,90741.0,377521.0,371370.0

In [2243]:
# make year column consistent
min_df_2022["year"] = 2022
for x in pop_df.columns:
    pop_df = pop_df.rename(columns={x: x.lower()})

In [2244]:
new_bfi_df = bfi_yrs.merge(
    pop_df.drop(columns="metro_title"),
    on=["metro13", "year"],
    how="left",
).merge(
    merged_all_ind[
        [
            "metro13",
            "year",
            "annual_avg_estabs_count",
            "annual_avg_emplvl",
            "total_annual_wages",
            "annual_avg_wkly_wage",
        ]
    ],
    on=["metro13", "year"],
    how="left",
)
new_bfi_df = new_bfi_df.rename(
    columns={
        "race/sex indicator": "race/sex_indicator",
        "total population": "total_population",
    }
)
new_bfi_df

,metro13,metro_title,change_ln_population,not_lbfr_share_prime_change,unemployed_share_prime_change,non_hc_share_prime_change,hc_emp_share_prime_change,manu_share_prime_change,non_manu_share_prime_change,manufacturing_share_prime1980,...,bac_female,bac_male,other_female,other_male,wac_female,wac_male,annual_avg_estabs_count,annual_avg_emplvl,total_annual_wages,annual_avg_wkly_wage
0,1,AL,0.006923,-0.010890,-0.016350,-0.020300,0.04754,-0.109100,0.13640,0.24990,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,5,AR,-0.027700,-0.022800,-0.016520,-0.009817,0.04915,-0.034590,0.07392,0.18920,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,6,CA,0.360200,-0.076470,-0.025230,0.080720,0.02098,-0.026890,0.12860,0.07481,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,8,CO,0.419600,-0.097020,-0.013250,0.087190,0.02308,0.008112,0.10220,0.03467,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,12,FL,0.463400,-0.056140,-0.005910,0.031780,0.03028,-0.065120,0.12720,0.09937,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1138,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",0.601800,-0.060330,0.002283,0.037890,0.02016,-0.006818,0.06487,0.03223,...,145369.0,132463.0,248433.0,240697.0,445414.0,437406.0,NaN,NaN,NaN,NaN
1139,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",0.601800,-0.060330,0.002283,0.037890,0.02016,-0.006818,0.06487,0.03223,...,553959.0,476844.0,218129.0,223829.0,336201.0,346238.0,NaN,NaN,NaN,NaN
1140,48620,"Wichita, KS",0.301400,-0.041580,0.019200,0.006006,0.01637,-0.103900,0.12630,0.24270,...,32296.0,32740.0,72626.0,73607.0,281438.0,280340.0,NaN,NaN,NaN,NaN
1141,49180,"Winston-Salem, NC",0.420900,0.003533,0.004468,-0.082680,0.07468,-0.193400,0.18540,0.30930,...,76734.0,66148.0,57616.0,56856.0,271780.0,260295.0,242.0,1713.0,9.351960e+07,1050.0
1142,49340,"Worcester, MA-CT",0.230900,-0.049690,0.003451,0.018820,0.02742,-0.159300,0.20560,0.25970,...,35478.0,36689.0,91948.0,90741.0,377521.0,371370.0,2187.0,36844.0,2.112492e+09,1103.0

In [2245]:
new_bfi_df.columns

Index(['metro13', 'metro_title', 'change_ln_population',
       'not_lbfr_share_prime_change', 'unemployed_share_prime_change',
       'non_hc_share_prime_change', 'hc_emp_share_prime_change',
       'manu_share_prime_change', 'non_manu_share_prime_change',
       'manufacturing_share_prime1980', 'ln_msa_pop2022', 'ln_msa_pop1980',
       'medicare_share1980', 'medicare_share2022', 'change_medicare_share',
       'ln_aearn1980', 'ln_aearn2022', 'change_earnings', 'college1980',
       'college2022', 'change_college', 'healthcare_share_prime2022',
       'healthcare_share_prime1980', 'change_non_hc_share_lbfr',
       'change_ln_non_hc', 'non_hc_manu_share_prime_change', 'year', 'tot_pop',
       'tot_male', 'tot_female', 'bac_female', 'bac_male', 'other_female',
       'other_male', 'wac_female', 'wac_male', 'annual_avg_estabs_count',
       'annual_avg_emplvl', 'total_annual_wages', 'annual_avg_wkly_wage'],
      dtype='object')